Revit 2027 API
ParameterTypeId.ExcavationElementId Property
 "Element Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ExcavationElementId { get; }
Public Shared ReadOnly Property ExcavationElementId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ExcavationElementId {
	ForgeTypeId^ get ();
}
static member ExcavationElementId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace